In [4]:
!pip install  sqlalchemy pyodbc

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: sqlalchemy in c:\program files\anaconda\1\lib\site-packages (2.0.34)
Requirement already satisfied: pyodbc in c:\program files\anaconda\1\lib\site-packages (5.1.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\program files\anaconda\1\lib\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\program files\anaconda\1\lib\site-packages (from sqlalchemy) (3.0.1)

# Data Extraction

# •	Extraction Tools:
## SQL Server Integration Services (SSIS) for data extraction.

## Data from Source Tables Database (gravity_books)
### Database Connection

In [5]:
import pyodbc
import pandas as pd
from datetime import datetime
import warnings
warnings.filterwarnings("ignore", category=UserWarning, message="pandas only supports SQLAlchemy connectable")

In [12]:
#conn = pyodbc.connect("DRIVER={ODBC Driver 17 for SQL Server};SERVER=DESKTOP-MF69IV4\\SQLEXPRESS;DATABASE=gravity_books;Trusted_Connection=yes")
cursor = conn.cursor()
server = r'DESKTOP-1VUSDJU'  # Correct the server name (if needed)
database = 'Store_books'
username = 'DESKTOP-1VUSDJU\\user'     # Escape the backslash properly
password = ''  # Empty, as Windows Authentication doesn't need a password here

# Using Windows Authentication
try:
    conn = pyodbc.connect(f'DRIVER={{ODBC Driver 17 for SQL Server}};'
                          f'SERVER={server};'
                          f'DATABASE={database};'
                          f'Trusted_Connection=yes;')
    print("✅ Connected to SQL Server successfully using Windows Authentication!")
except pyodbc.Error as e:
    print("❌ Error connecting to SQL Server:", e)

✅ Connected to SQL Server successfully using Windows Authentication!

## Data from author table

In [13]:
cursor.execute("SELECT * FROM author")
rows = cursor.fetchall()
data = [list(row) for row in rows]

author_column_names = [column[0] for column in cursor.description]
# Define your own column names
custom_column_names = ["Author_ID", "Name"]

# Create a Pandas DataFrame with your custom column names
Data = pd.DataFrame(data, columns=custom_column_names)

Data

      Author_ID                  Name
0             1  A. Bartlett Giamatti
1             2   A. Elizabeth Delany
2             3            A. Merritt
3             4      A. Roger Merrill
4             5        A. Walton Litz
...         ...                   ...
9230       9231                ?? ???
9231       9232                 ?????
9232       9233                  ????
9233       9234                   ???
9234       9235                   ???

[9235 rows x 2 columns]

## Data from book table

In [14]:
cursor.execute("SELECT * FROM book")
rows = cursor.fetchall()
data = [list(row) for row in rows]

book_column_names = [column[0] for column in cursor.description]
# Define your own column names
custom_column_names = ['book_id', 'title', 'isbn13', 'language_id', 'num_pages', 'publication_date', 'publisher_id']

# Create a Pandas DataFrame with your custom column names
BookData = pd.DataFrame(data, columns=custom_column_names)

BookData

,book_id,title,isbn13,language_id,num_pages,publication_date,publisher_id
0,1,The World's First Love: Mary Mother of God,8987059752,2,276,1996-09-01,1010
1,2,The Illuminati,20049130001,1,352,2004-10-04,1967
2,3,The Servant Leader,23755004321,1,128,2003-03-11,1967
3,4,What Life Was Like in the Jewel in the Crown: ...,34406054602,1,168,1999-09-01,1978
4,5,Cliffs Notes on Aristophanes' Lysistrata The ...,49086007763,1,80,1983-12-29,416
...,...,...,...,...,...,...,...
11122,11123,Asfixia,9789875661707,1,336,2006-09-01,511
11123,11124,El Dia Que Nietzsche Lloró,9789875801448,4,445,2006-10-24,1548
11124,11125,Fantasmas,9789879397503,4,442,2006-08-28,1284
11125,11126,Stand by Me,9789998691568,1,96,1986-06-01,430
11126,11127,The Great Divorce,9790007672386,1,160,2002-02-01,882

## Data from address table

In [15]:
cursor.execute("SELECT * FROM address")
rows = cursor.fetchall()
data = [list(row) for row in rows]

address_column_names = [column[0] for column in cursor.description]
custom_column_names = ['address_id', 'street_number', 'street_name', 'city', 'country_id']

# Create a Pandas DataFrame with your custom column names
addressData = pd.DataFrame(data, columns=custom_column_names)

addressData

     address_id street_number           street_name          city  country_id
0             1            57   Glacier Hill Avenue  Torbat-e Jam          95
1             2            86       Dottie Junction      Beaumont          37
2             3           292         Ramsey Avenue       Cayambe          60
3             4          5618    Thackeray Junction        Caldas          47
4             5             4              2nd Park      Ngunguru         153
..          ...           ...                   ...           ...         ...
995         996             5           Leroy Alley         Mmaaf          92
996         997            24  Morningstar Junction        Jobabo          53
997         998           429   Autumn Leaf Parkway  Changxingbao          42
998         999             2        Moose Crossing     Pasararba          92
999        1000           503       Canary Crossing     Jiangfeng          42

[1000 rows x 5 columns]

## Data from publisher table

In [16]:
cursor.execute("SELECT * FROM publisher")
rows = cursor.fetchall()
data = [list(row) for row in rows]

publisher_column_names = [column[0] for column in cursor.description]
publisher_column_names

# Define your own column names
custom_column_names = ['publisher_id','publisher_name']


# Create a Pandas DataFrame with your custom column names
PublishData = pd.DataFrame(data, columns=custom_column_names)

PublishData

      publisher_id                 publisher_name
0                1                          10/18
1                2               1st Book Library
2                3              1st World Library
3                4  A & C Black (Childrens books)
4                5   A Harvest Book/Harcourt Inc.
...            ...                            ...
2259          2260                   ????????????
2260          2261                   ????????????
2261          2262         ???? (Kadokawa Shoten)
2262          2263                            ???
2263          2264                            ???

[2264 rows x 2 columns]

## Data from book_language table

In [17]:
cursor.execute("SELECT * FROM book_language")
rows = cursor.fetchall()
data = [list(row) for row in rows]
book_language_column_names = [column[0] for column in cursor.description]

# Define your own column names
custom_column_names = ['language_code', 'language_id', 'language_name']

# Create a Pandas DataFrame with your custom column names
LanguageData = pd.DataFrame(data, columns=custom_column_names)

LanguageData

    language_code language_id          language_name
0               1         eng                English
1               2       en-US  United States English
2               3         fre                 French
3               4         spa                Spanish
4               5       en-GB        British English
5               6         mul     Multiple Languages
6               7         grc                  Greek
7               8         enm         Middle English
8               9       en-CA       Canadian English
9              10         ger                 German
10             11         jpn               Japanese
11             12         ara                 Arabic
12             13          nl                  Dutch
13             14         zho                Chinese
14             15         lat                  Latin
15             16         por             Portuguese
16             17         srp                Serbian
17             18         ita                Italian
18             19         rus                Russian
19             20         msa              Malaysian
20             21         glg               Galician
21             22         wel                  Welsh
22             23         swe                Swedish
23             24         nor              Norwegian
24             25         tur                Turkish
25             26         gla                 Gaelic
26             27         ale                  Aleut

## Data from book_author table

In [18]:
cursor.execute("SELECT * FROM book_author")
rows = cursor.fetchall()
data = [list(row) for row in rows]
book_author_column_names = [column[0] for column in cursor.description]
# Define your own column names
custom_column_names = ['book_id', 'author_id']

# Create a Pandas DataFrame with your custom column names
BookData = pd.DataFrame(data, columns=custom_column_names)

BookData

       book_id  author_id
0            1       2778
1            2       5049
2            3       4902
3            4       8651
4            5       8904
...        ...        ...
17637    11124       3492
17638    11125       1406
17639    11125       3889
17640    11126       7153
17641    11127       1020

[17642 rows x 2 columns]

## Data from country table

In [19]:
cursor.execute("SELECT * FROM country")
rows = cursor.fetchall()
data = [list(row) for row in rows]

country_column_names = [column[0] for column in cursor.description]

# Define your own column names
custom_column_names = ['country_id', 'country_name']

# Create a Pandas DataFrame with your custom column names
countryData = pd.DataFrame(data, columns=custom_column_names)

countryData

     country_id          country_name
0             1           Afghanistan
1             2  Netherlands Antilles
2             3               Albania
3             4               Algeria
4             5               Andorra
..          ...                   ...
227         228            Yugoslavia
228         229                Zambia
229         230              Zimbabwe
230         231             Singapore
231         232      French Polynesia

[232 rows x 2 columns]

## Data from customer table

In [20]:
cursor.execute("SELECT * FROM customer")
rows = cursor.fetchall()
data = [list(row) for row in rows]
customer_column_names = [column[0] for column in cursor.description]

# Define your own column names
custom_column_names = ['customer_id', 'first_name', 'last_name', 'email']

# Create a Pandas DataFrame with your custom column names
customerData = pd.DataFrame(data, columns=custom_column_names)

customerData

      customer_id  first_name    last_name                         email
0               1      Ursola        Purdy            upurdy0@cdbaby.com
1               2    Ruthanne       Vatini             rvatini1@fema.gov
2               3      Reidar      Turbitt        rturbitt2@geocities.jp
3               4        Rich        Kirsz            rkirsz3@jalbum.net
4               5     Carline        Kupis              ckupis4@tamu.edu
...           ...         ...          ...                           ...
1995         1996       Byron        Mayor         bmayorrn@netscape.com
1996         1997      Janean   Coatsworth  jcoatsworthro@purevolume.com
1997         1998  Georgeanna       Garman    ggarmanrp@surveymonkey.com
1998         1999      Ardeen        Caret              acaretrq@wsj.com
1999         2000      Delora  Bigglestone   dbigglestonerr@usatoday.com

[2000 rows x 4 columns]

## Data from customer_address table

In [21]:
cursor.execute("SELECT * FROM customer_address")
rows = cursor.fetchall()
data = [list(row) for row in rows]

customer_address_column_names = [column[0] for column in cursor.description]
# Define your own column names
custom_column_names = ['customer_id', 'address_id', 'status_id']

# Create a Pandas DataFrame with your custom column names
customer_addressData = pd.DataFrame(data, columns=custom_column_names)

customer_addressData

      customer_id  address_id  status_id
0               1          38          1
1               1         337          1
2               1         593          1
3               1         854          1
4               2           8          2
...           ...         ...        ...
5693         1999         667          1
5694         1999         796          1
5695         1999         900          1
5696         2000         216          1
5697         2000         777          1

[5698 rows x 3 columns]

## Data from cust_order table

In [25]:
cursor.execute("SELECT * FROM cust_order")
rows = cursor.fetchall()
data = [list(row) for row in rows]
cust_order_column_names = [column[0] for column in cursor.description]

# Define your own column names
custom_column_names = ['order_id','order_date', 'customer_id', 'shipping_method_id', 'dest_address_id']

# Create a Pandas DataFrame with your custom column names
cust_orderData = pd.DataFrame(data, columns=custom_column_names)
cust_orderData

Empty DataFrame
Columns: [order_id, order_date, customer_id, shipping_method_id, dest_address_id]
Index: []

## Data from order_line table

In [26]:
cursor.execute("SELECT * FROM order_line")
rows = cursor.fetchall()
data = [list(row) for row in rows]

order_line_column_names = [column[0] for column in cursor.description]

# Define your own column names
custom_column_names = ['line_id','order_id', 'book_id', 'price']

# Create a Pandas DataFrame with your custom column names
order_lineData = pd.DataFrame(data, columns=custom_column_names)

order_lineData

Empty DataFrame
Columns: [line_id, order_id, book_id, price]
Index: []

## Data from order_history table

In [27]:
cursor.execute("SELECT * FROM order_history")
rows = cursor.fetchall()
data = [list(row) for row in rows]
order_history_column_names = [column[0] for column in cursor.description]

# Define your own column names
custom_column_names = ['history_id','order_id', 'status_id', 'status_date']

# Create a Pandas DataFrame with your custom column names
order_historyData = pd.DataFrame(data, columns=custom_column_names)

order_historyData

Empty DataFrame
Columns: [history_id, order_id, status_id, status_date]
Index: []

# Data Transformation

## Columns of author table

In [28]:
author_column_names

['author_id', 'author_name']

## Columns of order_history table

In [29]:
order_history_column_names

['history_id', 'order_id', 'status_id', 'status_date']

## Columns of order_line table

In [30]:
order_line_column_names

['line_id', 'order_id', 'book_id', 'price']

## Columns of customer_order table

In [31]:
cust_order_column_names

['order_id',
 'order_date',
 'customer_id',
 'shipping_method_id',
 'dest_address_id']

## Columns of customer_address table

In [32]:
customer_address_column_names

['customer_id', 'address_id', 'status_id']

In [33]:
customer_addressData

      customer_id  address_id  status_id
0               1          38          1
1               1         337          1
2               1         593          1
3               1         854          1
4               2           8          2
...           ...         ...        ...
5693         1999         667          1
5694         1999         796          1
5695         1999         900          1
5696         2000         216          1
5697         2000         777          1

[5698 rows x 3 columns]

### Data Extracted from customer_address

In [34]:
New_customer_address = customer_addressData[['status_id']]
New_customer_address_customer_id = customer_addressData[['customer_id']]
New_customer_address_address_id = customer_addressData[['address_id']]

## Columns of customer table

In [35]:
customer_column_names

['customer_id', 'first_name', 'last_name', 'email']

### Data Extracted from customer

In [36]:
NewCustomerData = customerData[['first_name', 'last_name', 'email' ]]
NewCustomerData_customer_id = customerData[['customer_id']]

## Columns of country table

In [37]:
country_column_names

['country_id', 'country_name']

### Data exctracted from country

In [38]:
NewcountryData = countryData[['country_name']]
NewcountryData_country_id = countryData[['country_id']]

## Columns of book_author table

In [39]:
book_author_column_names

['book_id', 'author_id']

## Columns of book_language table

In [40]:
book_language_column_names

['language_id', 'language_code', 'language_name']

## Columns of publisher table

In [41]:
publisher_column_names

['publisher_id', 'publisher_name']

## Columns of address table

In [42]:
address_column_names

['address_id', 'street_number', 'street_name', 'city', 'country_id']

### Data exctracted from address

In [43]:
NewaddressData = addressData[['street_name', 'city']]
NewaddressData_address_id = addressData[['address_id']]

## Columns of book table

In [44]:
book_column_names

['book_id',
 'title',
 'isbn13',
 'language_id',
 'num_pages',
 'publication_date',
 'publisher_id']

# Transform Data for DimCustomer

In [45]:
current_date = datetime.now()

NewCustomerData_customer_id = NewCustomerData_customer_id.rename(columns={'customer_id':'customer_id_BK'})
NewaddressData_address_id = NewaddressData_address_id.rename(columns={'address_id':'address_id_BK'})
NewcountryData_country_id = NewcountryData_country_id.rename(columns={'country_id':'country_id_BK'})
New_customer_address_address_id = New_customer_address_address_id.rename(columns={'address_id':'status_id_BK'})
New_customer_address_status_id = New_customer_address_status_id.rename(columns={'address_id':'address_status'})

DimCustomerData = pd.concat([NewCustomerData_customer_id,                        
                         NewaddressData_address_id,                         
                         NewcountryData_country_id,                         
                         New_customer_address_address_id,
                         NewCustomerData,
                         NewcountryData, 
                         NewaddressData, 
                         New_customer_address_status_id
                         
                        ], 
                        axis=1, join='inner')
DimCustomerData['source_system_code'] = 'gravity_books'
DimCustomerData['start_date'] = current_date
DimCustomerData['end_date'] = pd.to_datetime('2025-12-31')
DimCustomerData['is_current'] = 1

DimCustomerData

NameError: name 'New_customer_address_status_id' is not defined

In [ ]:
conn = pyodbc.connect("DRIVER={ODBC Driver 17 for SQL Server};SERVER=DESKTOP-MF69IV4\\SQLEXPRESS;DATABASE=Data_Warehouse;Trusted_Connection=yes")
cursor = conn.cursor()

In [ ]:
insert_query = """INSERT INTO DimCustomer (customer_id_BK, address_id_BK, country_id_BK, status_id_BK, first_name, last_name, email, 
                        country_name, street_name, city, address_status, source_system_code, start_date, end_date, is_current
                        ) 
                        VALUES 
                        (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)"""

for index, row in DimCustomer.iterrows():
    cursor.execute(insert_query, (
        row['customer_id_BK'],
        row['address_id_BK'],
        row['country_id_BK'],
        row['status_id_BK'],
        row['first_name'],
        row['last_name'],
        row['email'],
        row['country_name'],
        row['street_name'],
        row['city'],
        row['address_status'],
        row['source_system_code'],
        row['start_date'],
        row['end_date'],
        row['is_current']
    ))
conn.commit()


print("Data inserted successfully into dbo.DimCustomer table.")

In [ ]:
print(DimCustomer.columns)

In [ ]:
cursor.execute("SELECT * FROM DimCustomer")
rows = cursor.fetchall()
data = [list(row) for row in rows]
customer_column_names = [column[0] for column in cursor.description]


# Create a Pandas DataFrame with your custom column names
selectedData = pd.DataFrame(data)

selectedData